In [59]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

train_df = pd.read_csv("./titanic/train.csv")
test_df = pd.read_csv("./titanic/test.csv")
submisson = pd.read_csv("./titanic/gender_submission.csv")

# 3.7 데이터 전처리와 특징값 생성

전처리가 필요한 데이터  
- Fare : 티켓요금
- Name : 이름
- Parch : 승성중인 부모와 자녀의 수
- SibSp : 승선중인 형제나 배우자의 수

## 학습데이터와 테스트 데이터의 통합

In [75]:
all_df = pd.concat([train_df,test_df],sort=False).reset_index(drop=True)
# all_df.head(5)
train_df.PassengerId.count(),test_df.PassengerId.count(),all_df.PassengerId.count()

(891, 418, 1309)

In [76]:
# 전체데이터를 통한 결측치 확인

all_cloumns = list(all_df.columns)
all_nulls =  list(all_df.isnull().sum())

#모든 cloumn 중에서 결측치의 값이 1이 아닌것만 표시
for (i,j) in zip(all_cloumns,all_nulls):
    if j != 0:
        print(i,j)

Survived 418
Age 263
Fare 1
Cabin 1014
Embarked 2

## 결측치 메우기

In [83]:
# 결측치 메우기(Fare)

#Pclass 별 Fare의 값을 계산해보자
Fare_mean = all_df[["Pclass","Fare"]].groupby("Pclass").mean().reset_index()
Fare_mean.columns = ["Pclass","Fare_mean"]
Fare_mean

   Pclass  Fare_mean
0       1  87.508992
1       2  21.179196
2       3  13.302889

In [84]:
#이제 이 평균값을 사용해 결측값을 채워보자
# 여기는 여러번 시행하면 안됨!!
all_df = pd.merge(all_df,Fare_mean, on="Pclass", how="left")
all_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'Fare_mean'],
      dtype='object')

In [89]:
#결측치가 위치한 곳을 찾음
all_df.loc[(all_df["Fare"].isnull()),"Fare"]

1043   NaN
Name: Fare, dtype: float64

In [90]:
#그곳을 평균값으로 대체
all_df.loc[(all_df["Fare"].isnull()),"Fare"] = all_df["Fare_mean"]
#이제 Fare_mean 속성 삭제
all_df = all_df.drop("Fare_mean",axis=1)
all_df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [91]:
all_df.isnull().sum()

PassengerId       0
Survived        418
Pclass            0
Name              0
Sex               0
Age             263
SibSp             0
Parch             0
Ticket            0
Fare              0
Cabin          1014
Embarked          2
dtype: int64